# Здесь будут лежать все глобальные переменные

# Имена всех локаций
location_name_full = ['тропа шашлычника', 'мангальная поляна', 'пёсий тракт', 'тропинка грибника', 'бродяжий путь',
                      'дубовая арка', 'секретная делянка', 'грязный овраг', 'родник надежды', 'обзорный холм',
                      'последняя беседка', 'перевал гопников', 'бомжовая балка', 'овраг разочарований',
                      'болота отчаянья',
                      'пустырь садовода', 'мусорный пустырь', 'ролевицкая поляна', 'безымянный луг', 'древний мангал',
                      'огромное кострище', 'покинутое селение рыбов', 'крапивная стена', 'бомжовые хоромы',
                      'родник восстановления']



# Блок имен мобов
mob_name_1 = ['бешенный', 'убогий', 'склизский', 'задиристый', 'злосчастный', 'идейный', 'воинствующий', 'ядерный',
              'ядрёный', 'повёрнутый', 'закисший', 'полумёртвый', 'громадный', 'настоящий', 'ослиный',
              'безудержный',
              'незримый', 'высокоточный', 'сказочный', 'фанатичный', 'сложный', 'упорный', 'безтолковый', 'царский',
              'воодушевленный', 'забористый', 'змкнутый', 'общительный', 'потерянный', 'скользкий']  # Какой
mob_name_2 = ['кал', 'гандон', 'черенок', 'сук', 'мотоциклист', 'гриб', 'ландух', 'одуванчик', 'бурьян', 'коньячок',
              'пень', 'бомж', 'саентолог', 'соловей', 'кисель', 'пидор', 'нефор', 'репер', 'рейвер', 'грибник',
              'кладмэн',
              'конь', 'навоз', 'голубь', 'цветочек', 'колдун', 'должанский', 'пу', 'стас', 'депутат']  # Кто
mob_name_3 = ['отчаянья', 'безумия', 'мести', 'говна', 'удачи', 'власти', 'всевластия', 'счастья', 'здоровья',
              'тлена',
              'греха', 'зависти', 'ревности', 'ада', 'прейсподней', 'духа', 'смелости', 'карадраса',
              'иеронима босха',
              'думы', 'правительства', 'говна', 'санкций', 'войны', 'путешествий', 'закрытых границ', 'пидораса',
              'лёхи',
              'земли', 'вселенной']  # Чего

# Блок имен оружия

# Блок имен брони
