lang_flag = 0

# Пока lang не актуален, но эта переменная будет служить флагом в функции вывода текста
lang = [['Добро пожаловать в Митинский лес! Здесь тебя ждет страх, ненависть и приключения!',
        'Выберете язык:\n1 - Русский\n2 - English',
        'Сейчас, к сожалению, доступен только русский. Но мы работаем над локализацией.'], ['это второе измерение массива ленг']]


texts = [['\nЕсли ты здесь впервые, рекомендуем пройти обучение. Впереди много опасностей.', 'Пройти обучение?',
              '1 - Да \n2 - Нет',
              '\nТвое приключение начинается здесь. Будь внимательнее и смелее. \nКаждая деталь, вздох, противник, найденая вещь или случайно услышанный звук - имеет значение.\nТебе нужно выбраться из этого леса любой ценой. Любой, кроме собственной жизни.\nПрислушайся к голосу в своей голове, он подскажет, как лучше поступить.\n',
              'Тени вокруг становятся плотней....\nОсмотрись...\n',
              'Что будешь делать?',
              '1 - Найти приключение\n2 - Посмотреть на себя\n3 - Посмотреть что в карманах\n4 - Перейти в...'
          ], ['english text']]

texts_lor_all = [['Как же здесь воняет, должно быть это...', 'Здесь темно и пахнет, кажется это...',
                 'Здесь холодно и пахнет, кажется это...', 'Очень похоже, что здесь живут бомжи.Но кажется это...',
                 'Мрачное место, вокруг кусты, и брошенные мангалы. Наверняка это...',
                 'Это место похоже на содержимое мусорного пакета. Но это точно...',
                 'Если бы меня вырвало, то на земле получилась бы...'], ['это второе измерение массива texts_lor_all']
                 ]
texts_new_location_lor = [['\nОооо, кажется этого места еще нет на моей карте...', '\nЧто это за новое место....', '\nЗдесь меня еще точно небыло...',
                           '\nКажется моя нога топчет новое место...', '\nДолбанные кусты, сложно через них пробраться, постойте...'], ['eng_text']]

texts_location_now = [['Куда хочешь пойти:', 'Назад', 'Некуда пойти... Вокруг только...', 'Ты сейчас находишься здесь...', 'Какие все знакомые места. Это же...', 'Я моргаю часто, но вокруг по прежнему...',
                       'Я хожу здесь уже целую вечность, а вокруг всё еще...', 'Мне бы пригодился компас, я всё еще здесь...'], ['english text']]

texts_location_teleport = [['Как же здесь... Ничего не изменилось... это по прежнему...', 'Как будто никуда не уходил... Это...', 'И снова не здравствуй...', 'Фуууу, это снова...', ], ['english text']]

texts_location_back = [['\nБольше некуда пойти... Остается только... ', '\nВокруг опять это.... ',
                       '\nКак же здесь хорошо, хотя кого я обманываю... Это же... ', '\nКак будто здесь уже ступала моя нога. Да это же... ',],
                       ['Это второе измерение массива texts_location_back']]


texts_stats_all = [['А я не так уж и плох...\n', 'Ветер гуляет между шампурами, а я все смотрю на себя...\n',
                   'Вайяяяяя, это что за красавчик здесь появился...\n',
                   'В человеке все должно быть идеально: погоны, кокарда...\n'], ['Это второе измерение массива texts_stats_all']
                    ]



texts_player_stats = [['Твоё здоровье:', 'Твоя сила:', 'Твоя ловкость:', ], ['eng_text']]

# Чисто затестить коммиты
