
# Пока lang не актуален, но эта переменная будет служить флагом в функции вывода текста
lang = ['Добро пожаловать в Митинский лес! Здесь тебя ждет страх, ненависть и приключения!',
        'Выберете язык:\n1 - Русский\n2 - English',
        'Сейчас, к сожалению, доступен только русский. Но мы работаем над локализацией.']
lang_flag = 0

texts = [['\nЕсли ты здесь впервые, рекомендуем пройти обучение. Впереди много опасностей.', 'Пройти обучение?',
              '1 - Да \n2 - Нет',
              '\nТвое приключение начинается здесь. Будь внимательнее и смелее. \nКаждая деталь, вздох, противник, найденая вещь или случайно услышанный звук - имеет значение.\nТебе нужно выбраться из этого леса любой ценой. Любой, кроме собственной жизни.\nПрислушайся к голосу в своей голове, он подскажет, как лучше поступить.\n',
              'Тени вокруг становятся плотней....\nОсмотрись...\n',
              'Что будешь делать?',
              '1 - Найти приключение\n2 - Посмотреть на себя\n3 - Посмотреть что в карманах\n4 - Перейти в...'
          ],



         ['english text']]

texts_lor_all = ['Как же здесь воняет, должно быть это...', 'Здесь темно и пахнет, кажется это...',
                 'Здесь холодно и пахнет, кажется это...', 'Очень похоже, что здесь живут бомжи.Но кажется это...',
                 'Мрачное место, вокруг кусты, и брошенные мангалы. Наверняка это...',
                 'Это место похоже на содержимое мусорного пакета. Но это точно...',
                 'Если бы меня вырвало, то на земле получилась бы...'
                 ]




